In [6]:
import pandas as pd
import numpy as np

pd.set_option("display.max_rows", 999)
pd.set_option("display.max_columns", 999)
pd.set_option('display.max_rows', 999)
pd.set_option('display.min_rows', 999)

%config IPCompleter.use_jedi = False

In [7]:
df = pd.read_csv('../data/df_clean_unreg.csv')
df['gr_droppedout_pct'] = df.gr_graduated / df.total
df['gr_graduated_pct'] = df.gr_graduated / df.total
df['gr_iep_pct'] = df.gr_iep / df.total
df['gr_ged_pct'] = df.gr_ged / df.total
df['gr_stillenrolled_pct'] = df.gr_stillenrolled / df.total

dropcols = ["Unnamed: 0", "Unnamed: 0.1", "district_cd", "cohortye", "total", "gr_droppedout", "gr_graduated", "gr_iep", "gr_ged", 
            "gr_stillenrolled", "outcome_yrs", "srcyear", "year", "district_from_df1", "subgroup", "district_from_faru", "districtid", "name", "district_name"]

df_thin = df.drop(columns=dropcols)
df_thin.head()

,num_asian,num_black,num_hisp,num_am_ind,num_white,num_lep,num_free_lunch,num_reduced_lunch,num_multi,ufb,staid,star,totstat,lrev,fedrev,totrev,state_aid_total_revenues,star_total_revenues,state_revenues_total_revenues,bded,cadm,tsal,pps,cds,boc,tui1,tui2,ois,oiexp,cser,opmt,tchr,heal,oeb,total_fringe_benefits,ound,oth,subtot,trans,dsp,dsi,texp,total_unexpended_surplus_funds_t,revenue_expenditures,var,dcaadm,rev_pupil,exp_pupil,av_twpu,inc_twpu,pwr,apwr,cwr,instructional_salaries,instructional_fringe_benefits,ins_fb,adjusted_expenditures__subtotal,ie1,ie1_total,ie2_instructional_expenditures_i,ie2,ie3_instructional_expenditures_i,ie3_adj_exp,loc_eff_rate,county_name,gr_droppedout_pct,gr_graduated_pct,gr_iep_pct,gr_ged_pct,gr_stillenrolled_pct
0,269.0,5952.0,918.0,21.0,1884.0,300.0,5505.0,970.0,0.0,5680290,54570126,10225351,64795477,98285968,16659701,179741146,0.303604,0.056889,0.360493,490999,2118256,54023846,5251097,4501195,3728010,188593,6610228,16305802,19303934,1199428,11203660,5165294,14257866,14441655,33864815,4053261,564400,163407524,5972182,7669294,5365766,182414766,0.031139,-2673620,-0.014657,10559,17022.553840,17275.761530,244659,93587,0.706290,0.789764,0.748027,83809950,3.117730e+07,0.170914,162986931,109912705.0,0.602543,1.410900e+08,0.773457,1.409014e+08,0.864495,26.51,Albany,0.658576,0.658576,0.033981,0.092233,0.080906
1,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.663212,0.663212,0.069085,0.046632,0.048359
2,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.564767,0.564767,0.051813,0.044905,0.193437
3,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.685665,0.685665,0.070812,0.050086,0.015544
4,382.0,4894.0,908.0,27.0,1592.0,405.0,4660.0,757.0,96.0,11443927,88986207,9683819,98670026,108582740,12186499,219439265,0.405516,0.044130,0.449646,325611,2333872,57538745,6323772,4632120,5340457,734445,7801336,18044340,30170560,428795,11628871,5143395,17442327,13876660,36462382,3527941,760170,186053417,6320002,8410609,6874804,207658832,0.055109,11780433,0.056730,10702,20504.509905,19403.740609,310466,103451,0.650327,0.694768,0.672548,91879434,3.307660e+07,0.159283,185202972,130585775.0,0.628800,1.636624e+08,0.788131,1.629279e+08,0.879726,21.25,Albany,0.646179,0.646179,0.036545,0.024917,0.054817

In [8]:
df.tail(20).to_csv('/Users/dave/src/CSE6242/dave/small_headers.csv')

# PCA, Modeling and Predictions by County

In [9]:
%%time
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn import linear_model
from sklearn.metrics import mean_squared_error, r2_score, accuracy_score


results = {}
county_agg_results = pd.DataFrame()

def train_model(X, y, test_size=0.30, random_state=42):
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=test_size, random_state=random_state)
    regr = linear_model.LinearRegression()
    regr.fit(X_train, y_train)
    y_pred = regr.predict(X_test)
    mse = mean_squared_error(y_test, y_pred)
    r2 = r2_score(y_test, y_pred)
    m1 = regr.coef_[0]
    m2 = regr.coef_[1]
    c = regr.intercept_
    return(y_pred, mse, r2, m1, m2, c)

i = 0
imp = {}

for county in df_thin.county_name.unique():
    county_df = df_thin[df_thin.county_name == county].drop(columns = ['county_name', 'num_am_ind'])
    X = county_df.drop(["gr_droppedout_pct", "gr_graduated_pct", "gr_iep_pct", "gr_ged_pct", "gr_stillenrolled_pct"], axis=1, inplace=False)
    y = pd.DataFrame({'y':county_df['gr_graduated_pct']}).reset_index()
    x = StandardScaler().fit_transform(X)
    pca = PCA(n_components=2)
    principalComponents = pca.fit_transform(x)
    principalDF = pd.DataFrame(data = principalComponents, 
                               columns = ['X1', 'X2'])
    
    
    n_pcs= pca.components_.shape[0]
    
    # get most important features:
    most_important = [np.abs(pca.components_[i]).argmax() for i in range(n_pcs)]

    initial_feature_names = list(X.columns)
    # get the names
    most_important_names = [initial_feature_names[most_important[i]] for i in range(n_pcs)]

    # LIST COMPREHENSION HERE AGAIN
    dic = {'PC{}'.format(i): most_important_names[i] for i in range(n_pcs)}

    # build the dataframe
    imp_df = pd.DataFrame(dic.items())
    imp[county] = imp_df
    
    
    raw_df = pd.concat([principalDF, y.y], axis=1)
    y_pred, mse, r2, m1, m2, c = train_model(X = principalDF, y = y.y)
    
    raw_df_pred = pd.concat([raw_df, pd.DataFrame(y_pred)], axis=1)
    
    raw_df_pred.rename(columns={0:'y_pred'}, inplace=True)
    results[county] = raw_df_pred    
    
    agg_results = pd.DataFrame({'EV': pca.explained_variance_ratio_[0] + pca.explained_variance_ratio_[1], 
                                'MSE': mse,
                                'R2': r2, 
                                'M1': m1,
                                'M2': m2,
                                'C': c}, 
                                index=[county])
    county_agg_results = county_agg_results.append(agg_results)
    i = i+1

# X1 - PCA1
# X2 - PCA2
# Y - gr_graduated_pct
# Pred Y () # this can be any model (linear regression + line of best fit formula (so C & M Parameters))
# County

CPU times: user 5.38 s, sys: 3.89 s, total: 9.27 s
Wall time: 1.75 s

# PCA Most Important Feature by County
It should be noted that these are mostly revenue and expenditure based.

In [21]:
imp

{'Albany':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Schoharie':      0       1
 0  PC0  totrev
 1  PC1     cwr,
 'Greene':      0          1
 0  PC0        ie1
 1  PC1  exp_pupil,
 'Schenectady':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Allegany':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Steuben':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Livingston':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Wyoming':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                         inc_twpu,
 'Cattaraugus':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                              apwr,
 'Broome':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Chenango':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Tioga':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                        ie1_total,
 'Delaware':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Cortland':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Chautauqua':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Erie':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                              apwr,
 'Cayuga':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Onondaga':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1          state_aid_total_revenues,
 'Oswego':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Wayne':      0       1
 0  PC0  totrev
 1  PC1     oth,
 'Tompkins':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                        rev_pupil,
 'Chemung':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Schuyler':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Otsego':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Madison':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              pwr,
 'Clinton':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Essex':      0                              1
 0  PC0         instructional_salaries
 1  PC1  state_revenues_total_revenues,
 'Franklin':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Columbia':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Dutchess':      0                         1
 0  PC0                       ie1
 1  PC1  state_aid_total_revenues,
 'Rensselaer':      0         1
 0  PC0       ie1
 1  PC1  inc_twpu,
 'Ulster':      0    1
 0  PC0  ie1
 1  PC1  cwr,
 'Putnam':      0                    1
 0  PC0               totrev
 1  PC1  star_total_revenues,
 'Genesee':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                           av_twpu,
 'Niagara':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Warren':      0                       1
 0  PC0  instructional_salaries
 1  PC1                inc_twpu,
 'St. Lawrence':      0       1
 0  PC0  totrev
 1  PC1     pwr,
 'Fulton':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Montgomery':      0                                 1
 0  PC0  ie3_instructional_expenditures_i
 1  PC1                               cwr,
 'Hamilton':      0       1
 0  PC0  totrev
 1  PC1     var,
 'Saratoga':      0       1
 0  PC0  totrev
 1  PC1     pwr,
 'Monroe':      0                              1
 0  PC0                           texp
 1  PC1  state_revenues_total_revenues,
 'Orleans':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                         exp_pupil,
 'Herkimer':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Oneida':      0                         1
 0  PC0                       ie1
 1  PC1  state_aid_total_revenues,
 'Jefferson':      0    1
 0  PC0  ie1
 1  PC1  ie2,
 'Lewis':      0     1
 0  PC0  tsal
 1  PC1   cwr,
 'Ontario':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                   num_free_lunch,
 'Nassau':      0                  1
 0  PC0                ie1
 1  PC1  num_reduced_lunch,
 'Seneca':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Yates':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              pwr,
 'Orange':      0         1
 0  PC0       ie1
 1  PC1  inc_twpu,
 'Sullivan':      0                                 1
 0  PC0  ie3_instructional_expenditures_i
 1  PC1                          inc_twpu,
 'Westchester':      0       1
 0  PC0  dcaadm
 1  PC1     cwr,
 'Washington':      0       1
 0  PC0  totrev
 1  PC1     cwr,
 'Rockland':      0             1
 0  PC0          tsal
 1  PC1  loc_eff_rate,
 'Suffolk':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                          inc_twpu}

In [10]:
# flatten dict to df

final_results = pd.DataFrame()

for k, v in results.items():
    df = v
    df.loc[:, 'county'] = k
    final_results = pd.concat([df, final_results], 0)

# final_results.columns = ['Unnamed: 0', 'X1', 'X2', 'y', 'y_pred', 'county']

In [11]:
final_results.head()

         X1        X2         y    y_pred   county
0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1  0.316367  0.643116  0.978836  0.899511  Suffolk
2  0.316367  0.643116  0.955908  0.848542  Suffolk
3  0.316367  0.643116  0.978836  0.901062  Suffolk
4  0.521213  1.308565  0.923875  0.873801  Suffolk

In [12]:
county_agg_results.head()

                   EV       MSE        R2        M1        M2         C
Albany       0.717430  0.002786  0.702530 -0.005648  0.025772  0.845356
Schoharie    0.635063  0.004321  0.070491 -0.002086  0.006593  0.830155
Greene       0.713559  0.003910  0.282484 -0.003642  0.010040  0.825641
Schenectady  0.715885  0.003802  0.744846 -0.012521  0.022741  0.832585
Allegany     0.632762  0.005167  0.106989 -0.001569  0.007430  0.851881

In [13]:
import pickle
# pickle.dump(final_results, open("../data/PCA_plus_preds.pkl", 'wb'))
# pickle.dump(county_agg_results, open("../data/county_agg_results.pkl", 'wb'))
final_results.to_csv('../data/PCA_plus_preds.csv')
county_agg_results.to_csv("../data/county_agg_results.csv")

In [14]:
a = pd.read_csv("../data/PCA_plus_preds.csv")
b = pd.read_csv("../data/county_agg_results.csv")

In [15]:
display(a.head())
display(b.head())

   Unnamed: 0        X1        X2         y    y_pred   county
0           0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1           1  0.316367  0.643116  0.978836  0.899511  Suffolk
2           2  0.316367  0.643116  0.955908  0.848542  Suffolk
3           3  0.316367  0.643116  0.978836  0.901062  Suffolk
4           4  0.521213  1.308565  0.923875  0.873801  Suffolk

    Unnamed: 0        EV       MSE        R2        M1        M2         C
0       Albany  0.717430  0.002786  0.702530 -0.005648  0.025772  0.845356
1    Schoharie  0.635063  0.004321  0.070491 -0.002086  0.006593  0.830155
2       Greene  0.713559  0.003910  0.282484 -0.003642  0.010040  0.825641
3  Schenectady  0.715885  0.003802  0.744846 -0.012521  0.022741  0.832585
4     Allegany  0.632762  0.005167  0.106989 -0.001569  0.007430  0.851881

In [16]:
# df_thin.groupby('county_name').count()
b.R2.mean()

0.27747936785574223

In [17]:
# df.tail(20).to_csv('/Users/dave/src/CSE6242/dave/small_headers.csv')

In [18]:
df.tail(20)

           X1        X2         y  y_pred   county
554 -4.587500 -2.784567  0.963077     NaN  Suffolk
555 -4.587500 -2.784567  0.954407     NaN  Suffolk
556 -4.363919 -1.804936  0.975155     NaN  Suffolk
557 -4.363919 -1.804936  0.960961     NaN  Suffolk
558 -4.363919 -1.804936  0.910299     NaN  Suffolk
559 -3.949911 -2.032501  0.943709     NaN  Suffolk
560 -3.949911 -2.032501  0.961078     NaN  Suffolk
561 -3.949911 -2.032501  0.941176     NaN  Suffolk
562 -3.804432 -1.700880  0.960784     NaN  Suffolk
563 -3.804432 -1.700880  0.950495     NaN  Suffolk
564 -3.804432 -1.700880  0.938312     NaN  Suffolk
565 -3.839119 -1.772186  0.967320     NaN  Suffolk
566 -3.839119 -1.772186  0.944805     NaN  Suffolk
567 -3.839119 -1.772186  0.917219     NaN  Suffolk
568 -3.929392 -1.780122  0.950820     NaN  Suffolk
569 -3.929392 -1.780122  0.941368     NaN  Suffolk
570 -3.929392 -1.780122  0.953416     NaN  Suffolk
571 -3.936791 -1.848364  0.957377     NaN  Suffolk
572 -3.936791 -1.848364  0.951768     NaN  Suffolk
573 -3.936791 -1.848364  0.965944     NaN  Suffolk

In [19]:
df.head()

         X1        X2         y    y_pred   county
0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1  0.316367  0.643116  0.978836  0.899511  Suffolk
2  0.316367  0.643116  0.955908  0.848542  Suffolk
3  0.316367  0.643116  0.978836  0.901062  Suffolk
4  0.521213  1.308565  0.923875  0.873801  Suffolk

# Feature Importance

In [128]:
from sklearn.feature_selection import SelectKBest, f_classif
from sklearn.linear_model import Lasso
from numpy import mean
from numpy import std
from numpy import absolute
from pandas import read_csv
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import RepeatedKFold
from sklearn.linear_model import Lasso
import seaborn as sns
from matplotlib import pyplot as plt
from sklearn.linear_model import LinearRegression





def lasso_me(X, y, alphas, names, test_size=0.30, random_state=42):
    results_df = pd.DataFrame()
    results_df['Feature Name'] = names
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=test_size, random_state=random_state)
    for alpha in alphas:
#         temp_df = pd.DataFrame()
        L2 = Lasso(alpha=alpha, 
                   max_iter=10000,
                   fit_intercept=False)
#         cv = RepeatedKFold(n_splits=10, n_repeats=3, random_state=1)
#         # evaluate model
#         scores = cross_val_score(L2, X_train, y_train, scoring='neg_mean_absolute_error', cv=cv, n_jobs=-1)
#         # force scores to be positive
#         scores = absolute(scores)
        L2.fit(X_train, y_train)
        column_name = 'Alpha = %f' % alpha
        results_df[column_name] = L2.coef_
    return(results_df)

county_lasso = {}

for county in df_thin.county_name.unique():
    county_df = df_thin[df_thin.county_name == county].drop(columns = ['county_name', 'num_am_ind'])
    X = county_df.drop(["gr_droppedout_pct", "gr_graduated_pct", "gr_iep_pct", "gr_ged_pct", "gr_stillenrolled_pct"], axis=1, inplace=False)
    y = pd.DataFrame({'y':county_df['gr_graduated_pct']}).reset_index()['y']

    x = StandardScaler().fit_transform(X)
    alphas = [0.0001, 0.001, 0.01]
    county_lasso[county] = lasso_me(x, y, 
                                    alphas = alphas, 
                                    names=X.columns, 
                                    test_size=0.30, 
                                    random_state=42)
import warnings
warnings.filterwarnings('ignore')

In [131]:
def plot_assumptions(X):
    fig, ((ax1, ax2), (ax3, ax4)) = plt.subplots(nrows=2, ncols=2, figsize=(16, 16))
#     # generate OLS model
#     # fit multiple linear regression model
#     model = LinearRegression()
#     model_fit = model.fit(X, y)
#     r_sq = model_fit.score(X, y)
#     sns.regplot(X, y)
    return(None)

# plot_assumptions(X)

# Feature Importance through Lasso Selection
Note: I don't love these results because we didn't validate typical assumptions of homoskedasticity, linearity, independence, etc.  They are, however, foundationally interesting for other types of studies, so I'm leaving them in here:

-dave

In [112]:
for county in df_thin.county_name.unique():
    print("\n==================== " + county + "========================")
    display(county_lasso[county].sort_values(by=['Alpha = %f' % a for a in alphas], ascending=False).head(3))

==================== Albany========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
4,num_lep,0.082683,0.078059,0.050122,0.0
45,rev_pupil,0.080694,0.065945,0.000000,-0.0
26,ois,0.079953,0.077499,0.046569,0.0

==================== Schoharie========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
26,ois,0.061520,0.061444,0.046159,0.005396
44,dcaadm,0.060755,0.056701,0.044845,0.000000
48,inc_twpu,0.055771,0.055715,0.053095,0.022573

==================== Greene========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
10,star,0.060120,0.056206,0.035061,0.000000
55,adjusted_expenditures__subtotal,0.056232,0.033648,0.000000,0.000000
48,inc_twpu,0.053542,0.051283,0.039496,0.004468

==================== Schenectady========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
46,exp_pupil,0.137341,0.123585,0.018017,0.0
53,instructional_fringe_benefits,0.090780,0.084139,0.022886,0.0
52,instructional_salaries,0.078391,0.069246,0.000000,0.0

==================== Allegany========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
3,num_white,0.120754,0.116131,0.103905,0.000000
26,ois,0.113479,0.115362,0.092603,0.010597
53,instructional_fringe_benefits,0.079939,0.085957,0.004026,-0.000000

==================== Steuben========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
53,instructional_fringe_benefits,0.105364,0.105206,0.043344,0.000000
34,ound,0.088270,0.087489,0.071086,0.000000
45,rev_pupil,0.080357,0.072340,0.015067,0.001399

==================== Livingston========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
12,lrev,0.189977,0.177286,0.091768,0.0
45,rev_pupil,0.084937,0.076650,0.011450,0.0
11,totstat,0.080639,0.063129,-0.000000,-0.0

==================== Wyoming========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
44,dcaadm,0.097572,0.092425,0.043441,0.0
45,rev_pupil,0.068048,0.057390,0.013279,0.0
36,subtot,0.061691,0.049482,0.000000,-0.0

==================== Cattaraugus========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
14,totrev,0.130186,0.118113,-0.003682,-0.000000
3,num_white,0.125968,0.129254,0.119071,0.029267
49,pwr,0.115539,0.113883,0.083283,0.029444

==================== Broome========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
33,total_fringe_benefits,0.100850,0.075162,-0.000000,-0.000000
36,subtot,0.095507,0.086325,0.010890,-0.000000
48,inc_twpu,0.091817,0.089813,0.077072,0.038978

==================== Chenango========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
53,instructional_fringe_benefits,0.088626,0.079781,0.033899,0.0
10,star,0.071472,0.068307,0.027579,0.0
14,totrev,0.056191,0.033724,-0.000000,-0.0

==================== Tioga========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
10,star,0.088170,0.087167,0.095839,0.029561
20,tsal,0.069982,0.066343,0.000000,0.000000
3,num_white,0.063055,0.060954,0.030027,0.000000

==================== Delaware========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
0,num_asian,0.069916,0.070083,0.067713,0.038506
49,pwr,0.064373,0.062878,0.042220,0.000000
44,dcaadm,0.056241,0.051126,0.028511,0.000000

==================== Cortland========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.115471,0.099350,0.055253,0.009011
44,dcaadm,0.095368,0.090911,0.096971,0.000000
14,totrev,0.088359,0.067637,0.000000,0.000000

==================== Chautauqua========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
55,adjusted_expenditures__subtotal,0.174506,0.162941,0.080703,-0.000000
22,cds,0.151583,0.150970,0.133389,0.072299
52,instructional_salaries,0.146743,0.136429,0.078572,0.000000

==================== Erie========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
2,num_hisp,0.135419,0.125860,0.043051,-0.0
26,ois,0.092039,0.080860,0.038683,-0.0
37,trans,0.072736,0.071612,0.032987,-0.0

==================== Cayuga========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
36,subtot,0.079903,0.078418,-0.000000,-0.000000
49,pwr,0.070367,0.073168,0.057833,0.017518
33,total_fringe_benefits,0.049902,0.030953,-0.000000,-0.000000

==================== Onondaga========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
46,exp_pupil,0.061925,0.048758,0.019483,0.007337
1,num_black,0.048760,0.048695,0.024619,-0.000000
20,tsal,0.047471,0.045637,0.000000,0.000000

==================== Oswego========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
9,staid,0.066683,0.045244,0.017537,0.000000
10,star,0.059336,0.054986,0.008659,-0.000000
54,ins_fb,0.050564,0.049870,0.040653,0.015906

==================== Wayne========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
33,total_fringe_benefits,0.118025,0.094048,-0.000000,-0.0
10,star,0.082320,0.077731,0.029215,0.0
0,num_asian,0.074578,0.073681,0.063536,0.0

==================== Tompkins========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
0,num_asian,0.129473,0.121522,0.037717,-0.0
10,star,0.120744,0.120331,0.100160,0.0
26,ois,0.104548,0.100693,0.028042,-0.0

==================== Chemung========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
10,star,0.133062,0.120195,0.046576,-0.000000
20,tsal,0.104164,0.096164,-0.000000,-0.000000
0,num_asian,0.090027,0.083693,0.061214,0.030057

==================== Schuyler========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
29,opmt,0.133265,0.128074,0.093726,0.0
31,heal,0.112109,0.105051,0.076695,-0.0
0,num_asian,0.100200,0.099599,0.068923,-0.0

==================== Otsego========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
44,dcaadm,0.113430,0.110781,0.045371,0.000000
45,rev_pupil,0.108898,0.094085,0.019494,0.000569
36,subtot,0.084642,0.077455,0.000000,0.000000

==================== Madison========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.085613,0.071790,0.025157,0.015838
3,num_white,0.081135,0.078897,0.056570,0.000000
11,totstat,0.077533,0.055357,-0.002510,-0.000000

==================== Clinton========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
53,instructional_fringe_benefits,0.075270,0.071447,0.000000,-0.0
44,dcaadm,0.067423,0.065153,0.027256,0.0
3,num_white,0.041745,0.040815,0.032159,0.0

==================== Essex========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
46,exp_pupil,0.272638,0.258616,0.132713,0.001789
29,opmt,0.242220,0.238977,0.211265,0.020210
53,instructional_fringe_benefits,0.182080,0.168081,0.043480,0.000000

==================== Franklin========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
31,heal,0.107726,0.107643,0.068470,-0.0
26,ois,0.101521,0.095958,0.042834,0.0
3,num_white,0.067974,0.066532,0.057474,0.0

==================== Columbia========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.072277,0.058763,0.006647,-0.000000
3,num_white,0.068296,0.061582,0.070028,0.007985
11,totstat,0.063201,0.039078,-0.000000,0.000000

==================== Dutchess========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.112332,0.100266,0.003022,0.000000
0,num_asian,0.088308,0.086218,0.054916,0.023116
40,texp,0.083818,0.074858,0.000000,0.000000

==================== Rensselaer========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
48,inc_twpu,0.078214,0.076668,0.062067,0.034519
55,adjusted_expenditures__subtotal,0.055073,0.040867,0.000000,0.000000
27,oiexp,0.043600,0.041681,0.047253,0.002999

==================== Ulster========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
53,instructional_fringe_benefits,0.082479,0.075383,0.076277,0.0
11,totstat,0.055585,0.033890,0.000000,-0.0
46,exp_pupil,0.049948,0.036801,-0.000000,-0.0

==================== Putnam========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
20,tsal,0.075952,0.081729,0.049804,0.0
9,staid,0.075264,0.073697,0.063864,0.0
36,subtot,0.051377,0.033101,0.000000,0.0

==================== Genesee========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
37,trans,0.076575,0.074527,0.053482,0.011953
46,exp_pupil,0.072390,0.065332,0.012551,0.003401
5,num_free_lunch,0.049173,0.047276,0.032156,-0.000000

==================== Niagara========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
20,tsal,0.064547,0.052387,0.000000,-0.000000
37,trans,0.064224,0.061381,0.063139,0.027516
11,totstat,0.057197,0.042466,-0.000000,-0.000000

==================== Warren========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.410304,0.399115,0.306033,0.000000
31,heal,0.159081,0.153894,0.100890,0.013899
10,star,0.118016,0.115098,0.071966,0.000000

==================== St. Lawrence========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
3,num_white,0.114714,0.113951,0.089823,0.0
53,instructional_fringe_benefits,0.104349,0.103728,0.077653,-0.0
52,instructional_salaries,0.098038,0.089037,0.000000,-0.0

==================== Fulton========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
3,num_white,0.242422,0.233839,0.195182,0.036683
11,totstat,0.229220,0.202220,-0.000000,-0.000000
2,num_hisp,0.102792,0.094476,0.045226,-0.000000

==================== Montgomery========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
52,instructional_salaries,0.144712,0.143205,0.125904,-0.000000
3,num_white,0.129307,0.129620,0.104375,0.009553
46,exp_pupil,0.120631,0.106863,0.000000,-0.000000

==================== Hamilton========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
49,pwr,1.029558,1.022268,0.967362,0.442661
40,texp,0.359978,0.337888,0.140625,0.000000
15,state_aid_total_revenues,0.323151,0.315682,0.283999,0.000000

==================== Saratoga========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
26,ois,0.121166,0.116246,0.098340,0.042433
12,lrev,0.088628,0.080474,0.034743,0.000000
33,total_fringe_benefits,0.060285,0.048757,0.000000,0.000000

==================== Monroe========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
26,ois,0.086973,0.080371,0.009953,-0.0
10,star,0.066067,0.061884,0.016641,-0.0
27,oiexp,0.061278,0.056761,0.029968,-0.0

==================== Orleans========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
12,lrev,0.071178,0.072480,0.037548,0.000000
52,instructional_salaries,0.049507,0.039555,-0.000000,0.000000
19,cadm,0.038072,0.034725,0.020022,0.007379

==================== Herkimer========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
3,num_white,0.205822,0.199104,0.155297,0.0
52,instructional_salaries,0.089554,0.068094,0.000000,0.0
12,lrev,0.082708,0.078217,0.078640,0.0

==================== Oneida========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
45,rev_pupil,0.096184,0.083209,0.005384,0.007964
29,opmt,0.073792,0.067866,0.024448,-0.000000
2,num_hisp,0.063577,0.048674,0.000000,-0.000000

==================== Jefferson========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
53,instructional_fringe_benefits,0.089873,0.082401,0.000000,-0.0
13,fedrev,0.071412,0.064894,0.029437,0.0
15,state_aid_total_revenues,0.065522,0.062918,0.037749,0.0

==================== Lewis========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
21,pps,0.136429,0.133812,0.100431,0.043888
3,num_white,0.130920,0.125350,0.043199,-0.000000
46,exp_pupil,0.120106,0.104687,0.000000,-0.000000

==================== Ontario========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
0,num_asian,0.147593,0.140385,0.107426,-0.000000
21,pps,0.082196,0.081457,0.077522,0.017078
40,texp,0.064316,0.055297,-0.000000,-0.000000

==================== Nassau========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
36,subtot,0.048791,0.045015,0.000000,0.000000
4,num_lep,0.035221,0.028795,0.002594,-0.010017
52,instructional_salaries,0.034910,0.022192,0.000000,0.000000

==================== Seneca========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
12,lrev,0.181235,0.173601,0.103991,0.0
4,num_lep,0.098488,0.094233,0.058515,-0.0
49,pwr,0.078467,0.081941,0.076604,0.0

==================== Yates========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
49,pwr,0.092554,0.091192,0.044621,0.002225
37,trans,0.087285,0.083018,0.045784,0.004053
4,num_lep,0.085894,0.068868,0.000000,0.000000

==================== Orange========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
36,subtot,0.079209,0.069886,-0.000000,-0.0
2,num_hisp,0.076796,0.074845,0.035340,-0.0
10,star,0.065311,0.061004,0.014961,-0.0

==================== Sullivan========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
11,totstat,0.102852,0.082406,0.000000,0.000000
44,dcaadm,0.092887,0.090106,0.061786,0.000000
3,num_white,0.078565,0.077548,0.058124,0.047779

==================== Westchester========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
40,texp,0.199892,0.179321,-0.000000,0.000000
50,apwr,0.113496,0.100885,0.062237,0.059403
5,num_free_lunch,0.098416,0.095467,0.071096,0.024081

==================== Washington========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
47,av_twpu,0.074981,0.067215,0.011296,-0.0
10,star,0.061426,0.058903,0.024400,0.0
9,staid,0.056286,0.043948,-0.000000,-0.0

==================== Rockland========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
47,av_twpu,0.019828,0.019827,0.015712,0.006016
15,state_aid_total_revenues,0.019651,0.011812,0.008833,0.000000
44,dcaadm,0.015992,0.022420,0.000000,0.000000

==================== Suffolk========================

,Feature Name,Alpha = 0.000000,Alpha = 0.000010,Alpha = 0.000100,Alpha = 0.001000
3,num_white,0.054654,0.054105,0.028918,0.004712
0,num_asian,0.049517,0.048573,0.033027,0.008684
37,trans,0.043363,0.042762,0.018195,0.000000